In [2]:
import pandas as pd
import numpy as np

In [3]:
#나라별 수도 및 인구
country_df=pd.DataFrame({"0":["벨기에","브뤼셀","1천만명"],"1":["인도","뉴델리","13억명"],"2":["브라질","브라질리아","2억명"]})
country_df

      0     1      2
0   벨기에    인도    브라질
1   브뤼셀   뉴델리  브라질리아
2  1천만명  13억명    2억명

In [8]:
country_df

'13억명'

13억 명을 출력하시오

In [4]:
country_df.loc[2][1]

'13억명'

In [9]:
country_df["1"][2] = "14억명"

In [1]:
dic_data = {"country":["벨기에","인도","브라질"],
            "capital":["브뤼셀","뉴델리","브라질리아"],
            "population":["1천만명","13억명","2억명"]}
df=pd.DataFrame(dic_data)
df

NameError: ignored

In [ ]:
df

  country capital population
0     벨기에     브뤼셀       1천만명
1      인도     뉴델리       13억명
2     브라질   브라질리아        2억명

In [ ]:
df.iloc[1,2]

'13억명'

In [ ]:
df.loc[1,"population"]

'13억명'

In [ ]:
for row in df:
    print("row = ", row)

row =  country
row =  capital
row =  population

In [ ]:
for row in range(0,len(df)):
    print("row= " , row)

row=  0
row=  1
row=  2

In [ ]:
for row in range(0,len(df)):
    print("1= ",df.iloc[row,0])
    print("1= ",df.iloc[row,1])
    print("2= ",df.iloc[row,2])
    print("-"*20)

1=  벨기에
1=  브뤼셀
2=  1천만명
--------------------
1=  인도
1=  뉴델리
2=  13억명
--------------------
1=  브라질
1=  브라질리아
2=  2억명
--------------------

In [ ]:
df.iloc[1,2] = "14억명"
df

  country capital population
0     벨기에     브뤼셀       1천만명
1      인도     뉴델리       14억명
2     브라질   브라질리아        2억명

In [ ]:
df["population"]

['1천만명', '13억명', '2억명']

# 실습 성적처리

In [ ]:
data = {"국어":[76,90,64,70,98],
        "영어":[65,75,79,82,93],
        "수학":[80,98,62,84,85]}

In [ ]:
df=pd.DataFrame(data)
df

   국어  영어  수학
0  76  65  80
1  90  75  98
2  64  79  62
3  70  82  84
4  98  93  85

In [ ]:
data = [[76,65,80],
        [90,75,98],
        [64,70,62],
        [70,82,84],
        [98,93,85]]
df1 = pd.DataFrame(data, columns=["국어","영어","수학"])
df1

   국어  영어  수학
0  76  65  80
1  90  75  98
2  64  70  62
3  70  82  84
4  98  93  85

In [ ]:
#총점구하기
df["총점"]=(df.iloc[0].sum(),df.iloc[1].sum(),df.iloc[2].sum(),df.iloc[3].sum(),df.iloc[4].sum())

In [ ]:
df

   국어  영어  수학   총점
0  76  65  80  221
1  90  75  98  263
2  64  79  62  205
3  70  82  84  236
4  98  93  85  276

In [ ]:
df["총점2"]=df["국어"]+df["영어"]+df["수학"]
df

   국어  영어  수학   총점  총점2
0  76  65  80  221  221
1  90  75  98  263  263
2  64  79  62  205  205
3  70  82  84  236  236
4  98  93  85  276  276

In [ ]:
#평균구하기
df["평균"]=(df.iloc[0,:3].mean(),df.iloc[1,:3].mean(),df.iloc[2,:3].mean(),df.iloc[3,:3].mean(),df.iloc[4,:3].mean())

In [ ]:
df["평균2"]=(df["국어"]+df["영어"]+df["수학"])/3

In [ ]:
df

   국어  영어  수학   총점  총점2        평균2
0  76  65  80  221  221  73.666667
1  90  75  98  263  263  87.666667
2  64  79  62  205  205  68.333333
3  70  82  84  236  236  78.666667
4  98  93  85  276  276  92.000000

In [ ]:
df["평균3"] = df.iloc[:,:3].mean(axis=1)
df

   국어  영어  수학   총점  총점2        평균2        평균3
0  76  65  80  221  221  73.666667  73.666667
1  90  75  98  263  263  87.666667  87.666667
2  64  79  62  205  205  68.333333  68.333333
3  70  82  84  236  236  78.666667  78.666667
4  98  93  85  276  276  92.000000  92.000000

In [ ]:
df.loc[0,"평균"]<90

True

In [ ]:
df["등급"]=""
for row in range(0, len(df)):
    #print(df.iloc[row,4])
    if df.iloc[row,5]>90:
        df.iloc[row,-1] = "s등급"
    elif df.iloc[row,5]>80:
        df.iloc[row,-1] = "a등급"
    elif df.iloc[row,5]>70:
        df.iloc[row,-1] = "b등급"
    else:
        df.iloc[row,-1] = "c등급"
df

   국어  영어  수학   총점  총점2        평균2        평균3   등급
0  76  65  80  221  221  73.666667  73.666667  b등급
1  90  75  98  263  263  87.666667  87.666667  a등급
2  64  79  62  205  205  68.333333  68.333333  c등급
3  70  82  84  236  236  78.666667  78.666667  b등급
4  98  93  85  276  276  92.000000  92.000000  s등급

In [ ]:
#정답
import pandas as pd
dic_data=  {"국어":[76,90,64,70,98],
            "영어":[65,75,79,82,93],
            "수학":[80,98,62,84,85]}
df=pd.DataFrame(dic_data)
df

   국어  영어  수학
0  76  65  80
1  90  75  98
2  64  79  62
3  70  82  84
4  98  93  85

In [ ]:
data= [[76,65,80],
       [90,75,98],
       [64,70,62],
       [70,82,84],
       [98,93,85]]
df1=pd.DataFrame(data, columns=["국어","영어","수학"])
df1

   국어  영어  수학
0  76  65  80
1  90  75  98
2  64  70  62
3  70  82  84
4  98  93  85

In [ ]:
#총점 구하기
df["총점"]=df["국어"]+df["영어"]+df["수학"]
df

   국어  영어  수학   총점
0  76  65  80  221
1  90  75  98  263
2  64  79  62  205
3  70  82  84  236
4  98  93  85  276

In [ ]:
#평균 구하기
df["평균"] =(df["국어"]+df["영어"]+df["수학"])/3
df

   국어  영어  수학   총점         평균
0  76  65  80  221  73.666667
1  90  75  98  263  87.666667
2  64  79  62  205  68.333333
3  70  82  84  236  78.666667
4  98  93  85  276  92.000000

In [ ]:
#평균 구하기2
df["평균1"]=df.iloc[:,:3].mean(axis=1)
df

   국어  영어  수학   총점         평균        평균1
0  76  65  80  221  73.666667  73.666667
1  90  75  98  263  87.666667  87.666667
2  64  79  62  205  68.333333  68.333333
3  70  82  84  236  78.666667  78.666667
4  98  93  85  276  92.000000  92.000000

In [ ]:
# 평균을 등급으로 나구기
df["등급"]="" 
for row in range(0,len(df)):
    print(df.iloc[row,4])
    if df.iloc[row,4]>90:
        df.iloc[row,-1]="s등급"
    elif df.iloc[row,4]>80:
        df.iloc[row,-1]="a등급"
    elif df.iloc[row,4]>70:
        df.iloc[row,-1]="b등급"
    else:
        df.iloc[row,-1]="c등급"
df

73.66666666666667
87.66666666666667
68.33333333333333
78.66666666666667
92.0

   국어  영어  수학   총점         평균        평균1   등급
0  76  65  80  221  73.666667  73.666667  b등급
1  90  75  98  263  87.666667  87.666667  a등급
2  64  79  62  205  68.333333  68.333333  c등급
3  70  82  84  236  78.666667  78.666667  b등급
4  98  93  85  276  92.000000  92.000000  s등급

In [ ]:
df.loc[df["평균"]>90, "등급2"]= "s등급"
df.loc[(df["평균"]>80) & (df["평균"]<=89), "등급2"]= "a등급"
df.loc[(df["평균"]>70) & (df["평균"]<=79), "등급2"]= "b등급"
df.loc[(df["평균"]<=69), "등급2"]= "c등급"
df

   국어  영어  수학   총점         평균        평균1   등급  등급2
0  76  65  80  221  73.666667  73.666667  b등급  b등급
1  90  75  98  263  87.666667  87.666667  a등급  a등급
2  64  79  62  205  68.333333  68.333333  c등급  c등급
3  70  82  84  236  78.666667  78.666667  b등급  b등급
4  98  93  85  276  92.000000  92.000000  s등급  s등급